<a href="https://colab.research.google.com/github/anicelysantos/book-python-para-analise-de-dados/blob/main/agregacao_operacao.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Imports

In [1]:
import pandas as pd
import numpy as np

# Funcionamento do GroupBy

In [2]:
df = pd.DataFrame({'key1':['a','a','b','b','a'], 'key':['one','two','one','two','one'], 'data1': np.random.randn(5), 'data2': np.random.randn(5)})
df

  key1  key     data1     data2
0    a  one  0.588939  1.923656
1    a  two -0.511368 -1.120217
2    b  one -1.751195  0.176476
3    b  two  0.614335  1.069682
4    a  one  0.877297  0.113371

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a    0.318289
b   -0.568430
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key']]).mean()
means

key1  key
a     one    0.733118
      two   -0.511368
b     one   -1.751195
      two    0.614335
Name: data1, dtype: float64

In [6]:
means.unstack()

key        one       two
key1
a     0.733118 -0.511368
b    -1.751195  0.614335

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -0.511368
            2006   -1.751195
Ohio        2005    0.601637
            2006    0.877297
Name: data1, dtype: float64

In [8]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.318289  0.305603
b    -0.568430  0.623079

In [9]:
df.groupby(['key1', 'key']).mean()

             data1     data2
key1 key
a    one  0.733118  1.018514
     two -0.511368 -1.120217
b    one -1.751195  0.176476
     two  0.614335  1.069682

In [10]:
df.groupby(['key1', 'key']).size()

key1  key
a     one    2
      two    1
b     one    1
      two    1
dtype: int64

**Iterando por grupos**

In [11]:
for nome, grupo in df.groupby('key1'):
  print(nome)
  print(grupo)

a
  key1  key     data1     data2
0    a  one  0.588939  1.923656
1    a  two -0.511368 -1.120217
4    a  one  0.877297  0.113371
b
  key1  key     data1     data2
2    b  one -1.751195  0.176476
3    b  two  0.614335  1.069682

In [12]:
for (k1,k2), grupo in df.groupby(['key1','key']):
  print((k1,k2))
  print(grupo)

('a', 'one')
  key1  key     data1     data2
0    a  one  0.588939  1.923656
4    a  one  0.877297  0.113371
('a', 'two')
  key1  key     data1     data2
1    a  two -0.511368 -1.120217
('b', 'one')
  key1  key     data1     data2
2    b  one -1.751195  0.176476
('b', 'two')
  key1  key     data1     data2
3    b  two  0.614335  1.069682

In [13]:
#gerando dicionario com uma parte dos dados

parte = dict(list(df.groupby('key1')))
parte['b']

  key1  key     data1     data2
2    b  one -1.751195  0.176476
3    b  two  0.614335  1.069682

In [14]:
df.dtypes

key1      object
key       object
data1    float64
data2    float64
dtype: object

In [15]:
grouped = df.groupby(df.dtypes, axis=1)
for dtype, grupo in grouped:
  print(dtype)
  print(grupo)

float64
      data1     data2
0  0.588939  1.923656
1 -0.511368 -1.120217
2 -1.751195  0.176476
3  0.614335  1.069682
4  0.877297  0.113371
object
  key1  key
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

**Selecionando uma coluna ou um subconjunto de colunas**

In [17]:
df.groupby(['key1', 'key'])[['data2']].mean()

             data2
key1 key
a    one  1.018514
     two -1.120217
b    one  0.176476
     two  1.069682

In [18]:
s_grouped = df.groupby(['key1', 'key'])['data2']
s_grouped

In [19]:
s_grouped.mean()

key1  key
a     one    1.018514
      two   -1.120217
b     one    0.176476
      two    1.069682
Name: data2, dtype: float64

**Agrupando com dicionário e séries**

In [22]:
people = pd.DataFrame(np.random.randn(5,5), columns=['a','b','c','d','e'], index=['Joe', 'Steve','Wes','Jim','Travis'])

In [24]:
people.iloc[2:3, [1,2]] = np.nan
people

               a         b         c         d         e
Joe    -2.056522  0.073972  0.429749 -0.840781 -1.403892
Steve   0.119013  0.533464 -1.856445  2.031567  1.038070
Wes    -1.095685       NaN       NaN  1.478770 -0.139479
Jim     0.755695  0.207923  0.050699 -0.776116  0.045133
Travis -0.460467 -1.040948 -0.970222  1.095539  1.049834

In [25]:
#somar as colunas por grupo
mapping = {'a': 'red', 'b':'red', 'c':'blue', 'd':'blue','e':'red','f':'orange'}

In [26]:
by_columns = people.groupby(mapping, axis=1)
by_columns.sum()

            blue       red
Joe    -0.411032 -3.386441
Steve   0.175122  1.690548
Wes     1.478770 -1.235164
Jim    -0.725417  1.008750
Travis  0.125317 -0.451581

In [27]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [28]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

**Agrupando com funções**

In [29]:
#agrupando por tamanho de string (contando string do índice)
people.groupby(len).sum()

          a         b         c         d         e
3 -2.396512  0.281896  0.480448 -0.138128 -1.498238
5  0.119013  0.533464 -1.856445  2.031567  1.038070
6 -0.460467 -1.040948 -0.970222  1.095539  1.049834

In [30]:
key_list = ['one', 'one', 'one','two','two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -2.056522  0.073972  0.429749 -0.840781 -1.403892
  two  0.755695  0.207923  0.050699 -0.776116  0.045133
5 one  0.119013  0.533464 -1.856445  2.031567  1.038070
6 two -0.460467 -1.040948 -0.970222  1.095539  1.049834

**Agrupando por níveis de índice**

In [33]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'], [1,3,5,1,3]], names=['cty','tenor'])
hier_df = pd.DataFrame(np.random.randn(4,5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.460087 -0.488456 -0.333935  0.507332  0.118081
1     -1.236595 -1.494991  1.653465 -0.036343 -0.283504
2      1.504100 -0.241045 -0.393843  0.449123  1.060360
3      1.260533  0.745536  0.316451 -1.995929  1.002213

In [35]:
hier_df.groupby(level = 'cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

# Agregação de dados